tutorials/heatTransfer/buoyantFoam/comfortHotRoom/0/PPD
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      PPD;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 46.0115;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 46.0115;
    }
    inlet
    {
        type            calculated;
        value           uniform 34.4876;
    }
    outlet
    {
        type            calculated;
        value           uniform 46.0115;
    }
}


// ************************************************************************* //
